[
   {
      "title":"Big Buck Bunny",
      "description":"Three rodents amuse themselves by harassing creatures of the forest. However, when they mess with a bunny, he decides to teach them a lesson.",
      "videoUrl":"http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/BigBuckBunny.mp4",
      "thumbnailUrl":"https://upload.wikimedia.org/wikipedia/commons/7/70/Big.Buck.Bunny.-.Opening.Screen.png",
      "genre":"Comedy",
      "duration":"10 minutes"
   },
   {
      "title":"Sintel",
      "description":"A lonely young woman, Sintel, helps and befriends a dragon, whom she calls Scales. But when he is kidnapped by an adult dragon, Sintel decides to embark on a dangerous quest to find her lost friend Scales.",
      "videoUrl":"http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/Sintel.mp4",
      "thumbnailUrl":"http://uhdtv.io/wp-content/uploads/2020/10/Sintel-3.jpg",
      "genre":"Adventure",
      "duration":"15 minutes"
   },
   {
      "title":"Tears of Steel",
      "description":"In an apocalyptic future, a group of soldiers and scientists takes refuge in Amsterdam to try to stop an army of robots that threatens the planet.",
      "videoUrl":"http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/TearsOfSteel.mp4",
      "thumbnailUrl":"https://mango.blender.org/wp-content/uploads/2013/05/01_thom_celia_bridge.jpg",
      "genre":"Action",
      "duration":"12 minutes"
   },
   {
      "title":"Elephant's Dream",
      "description":"Friends Proog and Emo journey inside the folds of a seemingly infinite Machine, exploring the dark and twisted complex of wires, gears, and cogs, until a moment of conflict negates all their assumptions.",
      "videoUrl":"http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/ElephantsDream.mp4",
      "thumbnailUrl":"https://download.blender.org/ED/cover.jpg",
      "genre":"Sci-Fi",
      "duration":"15 minutes"
   },
   {
      "title":"Migration",
      "description":"This holiday season, Illumination, creators of the blockbuster Minions, Despicable Me, Sing and The Secret Life of Pets comedies, invites you to take flight into the thrill of the unknown with a funny, feathered family vacation like no other in the action-packed new original comedy, Migration. The Mallard family is in a bit of rut. While dad Mack is content to keep his family safe paddling around their New England pond forever, mom Pam is eager to shake things up and show their kids—teen son Dax and duckling daughter Gwen—the whole wide world. After a migrating duck family alights on their pond with thrilling tales of far-flung places, Pam persuades Mack to embark on a family trip, via New York City, to tropical Jamaica. ",
      "videoUrl":"https://youtu.be/cQfo0HJhCnE",
      "thumbnailUrl":"https://i.ytimg.com/an_webp/cQfo0HJhCnE/mqdefault_6s.webp?du=3000&sqp=COWX_qUG&rs=AOn4CLBg_DN44_DpNup6ItCGVD7kA2OFfw",
      "genre":"Adventure",
      "duration":"3 minutes"
   },
   {
      "title":"Elemental | Official Trailer",
      "description":"Directed by Peter Sohn, produced by Denise Ream, p.g.a., and executive produced by Pete Docter, “Elemental” features a screenplay by John Hoberg & Kat Likkel and Brenda Hsueh with story by Sohn, Hoberg & Likkel and Hsueh. The film’s original score was composed and conducted by Thomas Newman.",
      "videoUrl":"https://youtu.be/hXzcyx9V0xw",
      "thumbnailUrl":"https://i.ytimg.com/vi/hXzcyx9V0xw/hq720.jpg?sqp=-oaymwEcCNAFEJQDSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLAOCSE3gV5z0nm5EF--zuo9RwT_fw",
      "genre":"Sci-Fi",
      "duration":"2 minutes 19 seconds"
   },
   {
      "title":"Strange World | Official Trailer",
      "description":"The feature film introduces a legendary family of explorers, the Clades, as they attempt to navigate an uncharted, treacherous land alongside a motley crew that includes a mischievous blob, a three-legged dog and a slew of ravenous creatures. “Inspired by classic adventure stories, said director Don Hall,‘Strange World’ is an original animated adventure/comedy about three generations of the Clade family who overcome their differences while exploring a strange, wondrous and oftentimes hostile world.",
      "videoUrl":"https://youtu.be/bKh2G73gCCs",
      "thumbnailUrl":"https://i.ytimg.com/vi/bKh2G73gCCs/hq720.jpg?sqp=-oaymwEcCNAFEJQDSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLDLe8ew4NPMCZzmPqMLUuSdQkCmdg",
      "genre":"Action",
      "duration":"2 minutes 21 seconds"
   }
]
